"""
Вы вступаете в приключение, наполняясь решимостью и уверенностью, что привидения – всего лишь сказки.
Заводим переменную feeling_brave и присваиваем ей значение True, ведь вы преисполнены храбрости.
Погружаясь в зловещий дом, вы находитесь в постоянном состоянии бесстрашия.
Пишем цикл while с условием feeling_brave == True, ведь вы не собираетесь останавливаться.
Перед вами развилка, три двери ведут в неизвестность. Вводите номер двери, решившись открыть её и идти вперёд.
Спрятано ли привидение за одной из дверей? Создаем переменную, куда записываем номер двери,
за которой, предположительно, могло прятаться привидение.
Открыв дверь и не обнаружив за ней ничего сверхъестественного, проверяем, что номер выбранной двери не совпадает
с номером, за которым притаилось привидение.
Подсчитывая пройденные двери, вы узнаете, сколько испытаний вы уже преодолели. У вас есть переменная,
в которой хранится количество открытых дверей. Это число увеличивается на единицу с каждым шагом в неизвестность.
Если за дверью оказывается привидение, ваша храбрость моментально испаряется. Проверяем совпадение номера
выбранной двери с номером, где скрывается привидение, либо используем конструкцию else, чтобы фиксировать внезапное
изменение вашего решимого настроения. Таким образом, вы покидаете дом, не оглядываясь, в поисках новых приключений.
"""
